<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"meta","backend":"f9e76cd27ef4984d78ed58494e572357190dc69600432351079a238525e26986","plan_job_ref":"Job Pull Request Checks #3794 at https://github.com/GSA-TTS/FAC/actions/runs/11348139080","plan_out_hash":"64703f4d2a8d4518468daf7923ea4f86dd5c96386566dc7b9a50b1beca016b64","plan_hash":"5b9a07e7c612390dfdccaf2587e9bef24807b036b9f0dd2890b5572c7e76f85c","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __meta__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.environments["dev"].local_file.initialization_script will be created
+   resource "local_file" "initialization_script" {
+       content              = <<-EOT
            #!/bin/bash
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            set -e
            terraform init \
              --backend-config=../shared/config/backend.tfvars \
              --backend-config=key=terraform.tfstate.$(basename $(pwd))
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0755"
+       filename             = "./../dev/init.sh"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.s3-backups.cloudfoundry_service_instance.bucket,
  on /tmp/terraform-data-dir/modules/s3-backups/s3/main.tf line 14, in resource "cloudfoundry_service_instance" "bucket":
  14:   recursive_delete = var.recursive_delete

Since CF API v3, recursive delete is always done on the cloudcontroller side.
This will be removed in future releases
```
</details>

:memo: Plan generated in [Pull Request Checks #3794](https://github.com/GSA-TTS/FAC/actions/runs/11348139080)